Documents/ЛБ_МаршрутПоездки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_МаршрутПоездки</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛомбардПользователя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяУбытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктНазначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛомбардПунктаНазначения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельПоездки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыТранспорта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЛБ_МаршрутПоездки/Ext/ManagerModule.bsl
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОтчетПоездок") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ОтчетПоездок", "Отчет поездок", 
		
		ПечатьОтчета(МассивОбъектов, ПараметрыПечати), , "Документ.ЛБ_МаршрутПоездки.ПФ_MXL_ОтчетПоездки");
	КонецЕсли; 	
	
КонецПроцедуры  

Функция ПечатьОтчета(МассивОбъектов, Период) 
	
	ТабДок = Новый ТабличныйДокумент; 
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛБ_МаршрутПоездки.ПФ_MXL_ОтчетПоездки");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка"); 
	
	Если Период.Свойство("Период") Тогда
		ОбластьШапка.Параметры.Период = СтрШаблон("за %1", Период.Период);
	Иначе
		ОбластьШапка.Параметры.Период = СтрШаблон("с %1 по %2", Период.НачалоПериода, Период.ОкончаниеПериода); 
	КонецЕсли;	
	
	ОбластьШапка.Параметры.ФИО = МассивОбъектов[0].Руководитель;
	ОбластьШапка.Параметры.Должность = МассивОбъектов[0].Должность;
	областьШапка.Параметры.Отделение = МассивОбъектов[0].Отделение;
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТЧ");
	ТабДок.Вывести(ОбластьШапкаТЧ);
	
	ОбластьТаблица = Макет.ПолучитьОбласть("СтрокаТЧ"); 
	Для Каждого Строка Из МассивОбъектов Цикл
		ЗаполнитьЗначенияСвойств(ОбластьТаблица.Параметры, Строка);
		Если ЗначениеЗаполнено(Строка.ПунктНазначения) Тогда
			ОбластьТаблица.Параметры.ПунктВизита = Строка.ПунктНазначения;
		ИначеЕсли 
			ЗначениеЗаполнено(Строка.ЛомбардПунктаНазначения) Тогда
			ОбластьТаблица.Параметры.ПунктВизита = Строка.ЛомбардПунктаНазначения;  
		КонецЕсли;
		ТабДок.Вывести(ОбластьТаблица); 
	КонецЦикла; 
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.ФИО = ПараметрыСеанса.ТекущийСотрудник;
	ТабДок.Вывести(ОбластьПодвал);	
	
	Возврат ТабДок;
КонецФункции
